; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-5-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p0-1 - location
	p0-3 - location
	p2-0 - location
	p3-0 - location
	p3-1 - location
	p3-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s1)
	(at driver3 s2)
	(at driver4 s3)
	(at driver5 s2)
	(at truck1 s1)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at package1 s1)
	(at package2 s3)
	(at package3 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s2 s3)
	(link s3 s2)
	(link s3 s0)
	(link s0 s3)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s0)
	(at driver3 s2)
	(at driver4 s1)
	(at driver5 s0)
	(at truck1 s0)
	(at truck2 s3)
	(at truck5 s3)
	(at package1 s1)
	(at package2 s2)
	(at package3 s1)
	))


)

; plan
1. (walk driver5 s2 p2-0)
   deleted: (at driver5 s2)
   added: (at driver5 p2-0)
   goals met: 3 of 11
2. (walk driver5 p2-0 s0)
   deleted: (at driver5 p2-0)
   added: (at driver5 s0)
   goals met: 4 of 11
3. (load-truck package2 truck4 s3)
   deleted: (at package2 s3)
   added: (in package2 truck4)
   goals met: 4 of 11
4. (board-truck driver4 truck4 s3)
   deleted: (at driver4 s3) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 4 of 11
5. (drive-truck truck4 s3 s2 driver4)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   goals met: 4 of 11
6. (unload-truck package2 truck4 s2)
   deleted: (in package2 truck4)
   added: (at package2 s2)
   goals met: 5 of 11
7. (drive-truck truck4 s2 s0 driver4)
   deleted: (at truck4 s2)
   added: (at truck4 s0)
   goals met: 5 of 11
8. (disembark-truck driver4 truck4 s0)
   deleted: (driving driver4 truck4)
   added: (at driver4 s0) (empty truck4)
   goals met: 5 of 11
9. (board-truck driver4 truck5 s0)
   deleted: (at driver4 s0) (empty truck5)
   added: (driving driver4 truck5)
   goals met: 5 of 11
10. (drive-truck truck5 s0 s3 driver4)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   goals met: 6 of 11
11. (disembark-truck driver4 truck5 s3)
   deleted: (driving driver4 truck5)
   added: (at driver4 s3) (empty truck5)
   goals met: 6 of 11
12. (board-truck driver2 truck2 s1)
   deleted: (at driver2 s1) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 6 of 11
13. (board-truck driver1 truck1 s1)
   deleted: (at driver1 s1) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 6 of 11
14. (drive-truck truck1 s1 s0 driver1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 7 of 11
15. (disembark-truck driver1 truck1 s0)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 8 of 11
16. (drive-truck truck2 s1 s0 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 8 of 11
17. (drive-truck truck2 s0 s3 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 9 of 11
18. (disembark-truck driver2 truck2 s3)
   deleted: (driving driver2 truck2)
   added: (at driver2 s3) (empty truck2)
   goals met: 9 of 11
19. (walk driver2 s3 p0-3)
   deleted: (at driver2 s3)
   added: (at driver2 p0-3)
   goals met: 9 of 11
20. (walk driver2 p0-3 s0)
   deleted: (at driver2 p0-3)
   added: (at driver2 s0)
   goals met: 10 of 11
21. (walk driver4 s3 p3-1)
   deleted: (at driver4 s3)
   added: (at driver4 p3-1)
   goals met: 10 of 11
22. (walk driver4 p3-1 s1)
   deleted: (at driver4 p3-1)
   added: (at driver4 s1)
   goals met: 11 of 11
